app/Http/Controllers/Frontend/CartController.php

    public function AddToCart(Request $request, $id){

        $course = Course::find($id);
---
select * from `courses` where `courses`.`id` = '21' limit 1