app/Http/Controllers/Frontend/WishListController.php

    public function GetWishlistCourse()
    {

        $wishlist = Wishlist::with('course')->where('user_id', Auth::id())->latest()->get();

        $wishQty = Wishlist::count();
---
select * from `wishlists` where `user_id` = 3 order by `created_at` desc
select count(*) as aggregate from `wishlists`