app/Models/User.php

    public static function getpermissionGroups(){
        $permission_groups = DB::table('permissions')->select('group_name')->groupBy('group_name')->get();
---
select `group_name` from `permissions` group by `group_name`

    public static function getpermissionByGroupName($group_name){

        $permissions = DB::table('permissions')
                        ->select('name','id')
                        ->where('group_name',$group_name)
                        ->get();
---
select `name`, `id` from `permissions` where `group_name` = 'Category'

    public function hasOrderedCourse($courseId)
    {
        return $this->orders()->where('course_id', $courseId)->exists();
---
select exists(select * from `orders` where `orders`.`user_id` = 3 and `orders`.`user_id` is not null and `course_id` = 22) as `exists`