app/Http/Controllers/Backend/CategoryController.php

select * from `categories` order by `created_at` desc
---
    public function AllCategory()
    {

        $category = Category::latest()->get();

select * from `categories` where `categories`.`id` = '42' limit 1
---
    public function EditCategory($id)
    {

        $category = Category::find($id);

insert into `sub_categories` (`category_id`, `subcategory_name`, `subcategory_slug`) values ('7', 'SubPelatihan', 'subpelatihan')
---
    public function StoreSubCategory(Request $request)
    {

        SubCategory::insert([
            'category_id' => $request->category_id,
            'subcategory_name' => $request->subcategory_name,
            'subcategory_slug' => strtolower(str_replace(' ', '-', $request->subcategory_name)),

        ]);