app/Http/Controllers/Backend/CouponController.php

    public function AdminAllCoupon()
    {

        $coupon = Coupon::latest()->get();
---
select * from `coupons` order by `created_at` desc

    public function InstructorStoreCoupon(Request $request){

        Coupon::insert([
            'coupon_name' => strtoupper($request->coupon_name),
            'coupon_discount' => $request->coupon_discount,
            'coupon_validity' => $request->coupon_validity,
            'instructor_id' => Auth::user()->id,
            'course_id' => $request->course_id,
            'created_at' => Carbon::now(),
        ]);
---
insert into `coupons` (`coupon_name`, `coupon_discount`, `coupon_validity`, `instructor_id`, `course_id`, `created_at`) values ('FREE', '10', '2024-05-30', 6, '16', '2024-05-30 01:30:18')