app/Http/Controllers/Backend/CourseController.php

    public function EditCourse($id)
    {

        $course = Course::find($id);
        $goals = Course_goal::where('course_id', $id)->get();
        $categories = Category::latest()->get();
        $subcategories = SubCategory::latest()->get();
---
select * from `courses` where `courses`.`id` = '12' limit 1
select * from `course_goals` where `course_id` = '12'
select * from `categories` order by `created_at` desc
select * from `sub_categories` order by `created_at` desc