app/Http/Controllers/Backend/OrderController.php

select * from `payments` where `id` = '41' limit 1
select * from `orders` where `payment_id` = '41' order by `id` desc
---
    public function InstructorOrderDetails($payment_id){

        $payment = Payment::where('id',$payment_id)->first();
        $orderItem = Order::where('payment_id',$payment_id)->orderBy('id','DESC')->get();

select * from `orders` where `course_id` = '12' and `user_id` = 3 limit 1
select * from `course_sections` where `course_id` = '12' order by `id` asc
---
    public function CourseView($course_id){
        $id = Auth::user()->id;

        $course = Order::where('course_id',$course_id)->where('user_id',$id)->first();
        $section = CourseSection::where('course_id',$course_id)->orderBy('id','asc')->get();