app/Http/Controllers/Backend/ReviewController.php

select * from `reviews` where `status` = 0 order by `id` desc
---
    public function AdminPendingReview(){

        $review = Review::where('status',0)->orderBy('id','DESC')->get();