app/Http/Controllers/Backend/RoleController.php

    public function AllRolesPermission(){

        $roles = Role::all();
---
select * from `roles`

    public function AdminEditRoles($id){

        $role = Role::find($id);
        $permissions = Permission::all();
---
select * from `roles` where `roles`.`id` = '3' limit 1
select * from `permissions`