app/Http/Controllers/Backend/SettingController.php

select * from `smtp_settings` where `smtp_settings`.`id` = 1 limit 1
---
    public function SmtpSetting(){

        $smpt = SmtpSetting::find(1);